# ExternalGeometryId Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalGeometryId Properties
ExternalGeometryId Class See Also
---
The ExternalGeometryId type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Id | External geometry identifier. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ExternalGeometryId Class
Autodesk.Revit.DB Namespace